tutorials/combustion/reactingFoam/ras/counterFlowFlame2D/Allrun
#!/bin/sh
# Source tutorial run functions
. $WM_PROJECT_DIR/bin/tools/RunFunctions

application="reactingFoam"

runApplication blockMesh
runApplication $application
